Tekla Open API Reference for Tekla Structures 2025
Object Class
 The Object class is an abstract base class for all the objects Tekla Structures has.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class Object
<SerializableAttribute>
Public MustInherit Class Object
The Object type exposes the following members.
Properties
Name | Description
Identifier
 The identifier of the object.
Top
See Also
Reference
Tekla.Structures.Model Namespace